# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь,
# ключи — первые буквы имён, значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# Пример:
# in# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# # out
# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}


names = ["Иван", "Мария", "Петр", "Илья", "Кузя",
         "Zina", "Марина", "Петр", "Алина", "Бибочка"]


def dictionary(lst):
    return dict(sorted(((i[0], sorted([j for j in lst if j[0] == i[0]]))
                        for i in lst), key=lambda x: x[0]))


print(dictionary(names))
